app/controllers/books_controller.rb

  def create
    @type   = params[:type]
    @value  = params[:value]
    @item = Item.lookup @type, @value
    begin
      @item.save!
---
INSERT INTO "items" ("name", "rating", "artwork", "image_height", "location", "created_at", "updated_at", "publication_date", "image_width", "year", "item_type_id", "image") VALUES('Filler', NULL, NULL, 500, NULL, '2011-04-09 21:48:05', '2011-04-09 21:48:05', '2005-04-27', 333, 2005, 1, 'http://ecx.images-amazon.com/images/I/41H29YCP5RL.jpg')
INSERT INTO "key_types" ("name", "created_at", "updated_at", "item_type_id") VALUES('EAN', '2011-04-09 23:15:33', '2011-04-09 23:15:33', NULL)

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1) ORDER BY name