app/controllers/creator_types_controller.rb

SELECT * FROM "item_types" ORDER BY name
---
  def new
    @creator_type = CreatorType.new
    @item_types   = ItemType.all

INSERT INTO "creator_types" ("name", "created_at", "updated_at", "item_type_id") VALUES('illustrator', '2010-08-08 22:42:48', '2010-08-08 22:42:48', 2)
---
  def create
    @creator_type = CreatorType.new params[:creator_type]
    begin
      @creator_type.save!

SELECT * FROM "creator_types" WHERE ("creator_types"."id" = 1)
SELECT * FROM "item_types" ORDER BY name
---
  def edit
    @creator_type = CreatorType.find params[:id]

SELECT * FROM "creator_types" WHERE ("creator_types"."id" = 3)
UPDATE "creator_types" SET "updated_at" = '2010-09-01 23:59:59', "name" = 'writer' WHERE "id" = 3
---
  def update
    @creator_type = CreatorType.find params[:id]
    begin
      @creator_type.update_attributes params[:creator_type]

SELECT * FROM "creator_types"
---
  def index
    @creator_types = CreatorType.all