app/controllers/items_controller.rb

  def edit
    @item = Item.find params[:id]
---
SELECT * FROM "items" WHERE ("items"."id" = 1) ORDER BY name

  def index
    #@items = Creator.find(27).items.find(:all, :conditions=>"itemable_type='Book'")
    @items = Item.all
---
SELECT * FROM "items" ORDER BY name