app/controllers/item_types_controller.rb

INSERT INTO "item_types" ("name", "created_at", "updated_at") VALUES('Graphic Novel', '2010-08-08 22:04:00', '2010-08-08 22:04:00')
---
  def create
    @item_type = ItemType.new params[:item_type]
    begin
      @item_type.save!

SELECT * FROM "item_types" WHERE ("item_types"."id" = 1) ORDER BY name
---
  def edit
    @item_type = ItemType.find params[:id]

SELECT * FROM "item_types" WHERE ("item_types"."id" = 1) ORDER BY name
UPDATE "item_types" SET "updated_at" = '2010-08-08 22:12:33', "name" = 'video game' WHERE "id" = 1
---
  def update
    @item_type = ItemType.find params[:id]
    begin
      @item_type.update_attributes params[:item_type]

SELECT * FROM "item_types" ORDER BY name
---
  def index
    @item_types = ItemType.all